-- theme color pallete: https://www.colourpod.com/post/173929539115/a-medieval-recipe-for-murder-submitted-by

translations["ar"] = {
	OUT_OF_RESOURCES = "<font color='#ab5e42'>[</font> <font color='#c6b392'>•</font> <font color='#ab5e42'>]</font> <font color='#c6b392' face='Lucida Console'>نفذت الموارد</font>",
	NEW_RECIPE = "<font color='#506d3d' size='8'><b>[وصفة جديدة]</b></font> <font color='#ab5e42' face='Lucida Console'><b>${itemName}</b></font>\n<font color='#bd9d60' size='11' face='Lucida Console'>(${itemDesc})</font>",
	NEW_QUEST = "<font color='#506d3d' size='8'><b>[مهمة جديدة]</b></font> <font color='#ab5e42' face='Lucida Console'><b>${questName}</b></font>",
	NEW_STAGE = "<font color='#506d3d' size='8'><b>[تحديث]</b></font> <font color='#ab5e42' face='Lucida Console'><b>${questName}</b></font>\n<font color='#bd9d60' size='11' face='Lucida Console'>(${desc})</font>",
	STAGE_PROGRESS = "<font color='#506d3d' size='8'><b>[تحديث]</b></font> <font color='#ab5e42' face='Lucida Console'><b>${questName}</b></font> <font color='#bd9d60' size='11' face='Lucida Console'>( ${progress} / ${needed} )</font>",
	QUEST_OVER = "<font color='#506d3d' size='8'><b>[اكتملت المهمة]</b></font> <font color='#ab5e42' face='Lucida Console'><b>${questName}</b></font>",
	SPIRIT_ORB = "<b><font color='#ab5e42' face='Lucida Console'>لقد تلقيت <font color='#bd9d60' face='Lucida Console'>!روح الجرم السماوي</font></font></b>",
	PASSCODE = ".الرجاء إدخال مفتاح الوصول",
	WRONG_GUESS = "<R>.مفتاح الوصول غير صحيح</R>",
	INVENTORY_INFO = "<font face='Lucida Console'><p align='center'><font color='#${color}' size='9'>:وزن ${weight}</font>\n\n\n\n<font size='9'><N2><b>[X] ارمي</b></N2></font></p></font>",
	FULL_INVENTORY = "<font color='#ab5e42'>[</font> <font color='#c6b392'>•</font> <font color='#ab5e42'>]</font> <font color='#c6b392' face='Lucida Console'>المخزون الخاص بك هو الكامل</font>",
	FINAL_BOSS_ENTER_FAIL = "<font color='#ab5e42'>[</font> <font color='#c6b392'>•</font> <font color='#ab5e42'>]</font> <font color='#c6b392' face='Lucida Console'>تحتاج إلى الحصول على الجرم السماوي التنين للدخول إلى هذه البوابة/font>",
	CRAFT = "اصنع",
	CANT_CRAFT = "لاتستطيع الصنع",
	RECIPE_DESC = "\n\n<font face='Lucida console' size='12' color='#999999'><i>“ ${desc} ”</i></font>",
	FINAL_BATTLE_PING = "<font color='#ab5e42'>[</font> <font color='#c6b392'>•</font> <font color='#ab5e42'>]</font> <font color='#c6b392' face='Lucida Console'>!المعركة النهائية تحدث</font>",
	ACTIVATE_POWER = "<font color='#ab5e42'>[</font> <font color='#c6b392'>•</font> <font color='#ab5e42'>]</font> <font color='#c6b392' face='Lucida Console'>اضغط <font color='#ab5e42'><b>U</b></font> للتبديل <font color='#ab5e42'><b>القوة العظمى</b></font></font>",
	ANNOUNCER_DIALOGUES = {
		"انتبهوا الجميع! الانتباه!!!",
		"...هذه الرسالة من صاحب الجلالة ملك هذه الأرض",
		".تتعرض أرضنا للهجوم من قبل الوحوش التي لا تعرف الرحمة التي هُزمت منذ فترة",
		".يأتي هذا في أعقاب الحدث المؤسف الذي لم يتم الإعلان عنه بعد \n<b><VP>.تم اختطاف أميرتنا</VP></b>",
		".تمكنت الوحوش التي لا تعرف الرحمة أيضًا من الإفلات تقريبًا من الخزانة التي كانت لدينا",
		"يبحث الملك عن جنود شجعان يساعدون الجيش على هزيمة كل هذه الوحوش وإنقاذ الأميرة\n مع خزانتنا",
		"...الملك يأمل في حضور كل القلوب الشجاعة\n"
	},
	NOSFERATU_DIALOGUES = {
		"آه تبدو جديدًا تمامًا هنا على أي حال تبدو مفيدًا",
		"إذن أنت تقول ، لقد أتيت إلى هنا من بُعد آخر وليس لديك أي فكرة عن مكانك أو ما يجب القيام به على الإطلاق\n<i>*حسنًا ، ربما يكون مفيدًا لي حقًا</i>",
		"حسنًا أيها الشاب ، أعتقد أنك بحاجة إلى عمل لتعيش فيه. لا تقلق بشأن ذلك ، سأعطيك وظيفة نعم نعم",
		".لكن ... قبل ذلك ، نحتاج إلى التحقق مما إذا كنت في حالة بدنية جيدة\n <VP><b> 15 خشب </b></VP> اجمع.\nبالنسبة لي من الغابة\nاحصل على هؤلاء \n<VP><b>10 حجر</b></VP>\n!كمقدم. حظا طيبا وبالتوفيق",
		"مثير للإعجاب حقا. ولكن \n<i>في ايامنا</i> ...لقد فعلناها بشكل أسرع \nليس مثل ما يهم الآن. كما وعدت \n .انها لك <VP><b>الوظيفة</b></VP> ",
		"ومع ذلك ، يمكنك الآن الوصول إلى \n<b><VP>منجم</VP></b>\nتوجه الى\n<b><VP>الباب</VP></b>\n على الجانب الأيسر من هنا و \n<b><VP>↓</VP></b>!للوصول إليه",
		"باعتبارها وظيفتك الأولى ، أحتاج منك أن تجمع\n<b><VP> 15 قطعة حديد</VP></b>\n !حظا سعيدا مرة أخرى",
		"!واو! يبدو أنني قللت من تقديرك ، يا له من عمل مثير للإعجاب",
		"لقد سمعت ان \n<b><VP>القلعة</VP></b> \n...تحتاج إلى بعض الشباب مثلك لإنقاذ خزنتها والأميرة من الأشرار",
		" من الممكن ان تكون مناسبا لذلك",
		"سوف اعطيك \n<b><VP>رسالة توصية نوسفيراتو\n</VP></b>, قدم هذا لـ \n<b><VP>الملازم</VP></b>\n .ونأمل أن يجندك في الجيش\n<i>وهذا بعض المال الجيد أيضًا</i>",
		"أوه ولا تنسى مكافأتك \n<b><VP>30 حجر</VP></b>\n!لكل العمل الشاق",
		"هل تحتاج لأي شيء؟",
		"هذه معرفة عامة تمامًا ... أنت بحاجة إلى\n <b><VP>قطع الشجرة بالفأس</VP></b>",
		"لذلك أنت بحاجة إلى  \n<b><VP>فأس</VP></b> \nيجب أن يكون هناك واحد في جوار \n<b><VP>الغابة</VP></b>. <b><VP>↓</VP></b>\n لدراستها وصياغة الوصفة المدروسة في\n <b><VP>محطة صياغة</VP></b>\n.تقع المحطة فوق هذا المنجم مباشرةً",
		"انا ابيع \n<b><VP>10 حجر</VP></b>\n مقابل \n<b><VP>35 عصا</VP></b>",
		"آه طيب وداعا بعد ذلك",
		".يبدو أن مخزونك ممتلئ. ماذا عن تفريغها بالاول بعد ذالك يمكنك ان تعود لمكافأتك",
		"!سعيد بالتعامل معك",
		".يبدو أنه ليس لديك عناصر كافية للقيام بهذه التجارة"
	},
	NOSFERATU_QUESTIONS = {
		"كيف أحصل على الخشب؟",
		"فأس؟",
		"تبادل",
		".لا تهتم",
		"It's something else."
	},
	EDRIC_DIALOGUES = {
		"أميرتنا ... والخزانة في أيدي الشر. علينا أن نسرع",
		"توقف. انت تقول ان \n<b><VP>نوسفيراتو</VP></b>\n أرسلتك إلى هنا ويمكنك مساعدة قواتنا في المهمات ؟؟؟",
		".ذلك رائع. لكن العمل في جيش ليس بالأمر السهل كما تعتقد\nسوف تحتاج إلى القيام ببعض \n<b><VP>تدريب مكثف</VP></b> \n.مع الأخذ في الاعتبار أن جسمك ليس بالقوة المطلوبة أيضًا\nاتجه الى \n<b><VP>منطقة التدريب على الجانب الأيسر مني</VP></b>\n. لبدء تدريبك",
		"لكن قبل ذلك ، تأكد من أنك على استعداد تام. هناك القليل \n<b><VP>وصفات</VP></b> \nمنتشرة حول \n<b><VP>رفوف السلاح</VP></b> و <b><VP>الغابات القاتمة أسفل التل</VP></b>\n!آمل أن تستفيد منهم بشكل جيد",
		"!تحدث معي مرة أخرى عندما تعتقد أنك مستعد",
		"هل انت مستعد لقبول التحدي؟",
		"رائعة! اذهب وابدأ تدريبك في منطقة التدريب. أنت بحاجه إلى \n<b><VP>هزيمة 25 وحشًا</VP></b>\n .لاجتياز هذا التحدي",
		"!!!يمكنك أن تأخذ الكثير من الوقت الذي تريده لك حظًا سعيدًا ",
		"لقد أثبتت أنك مستحق! عجل!!! انضم إلى بقية جنودنا وحارب الوحوش!"
	},
	EDRIC_QUESTIONS = {
		"...أنا بحاجة لمزيد من الوقت",
		"!أنا مستعد"
	},
	GARRY_DIALOGUES = {
		".هذا هو أسوأ مكان ذهبت إليه على الإطلاق \n<b><VP>نوسفيراتو</VP></b>\n... لا يدفع ما يكفي حتى \n<i>*...تنهد*</i>"
	},
	THOMPSON_DIALOGUES = {
		"مرحبًا! هل تريد شيئا مني؟",
		"إذا كنت تبحث عن \n<b><VP>مجرفة</VP></b>\n يجب أن يكون هناك واحد في \n<b><VP>الجزء الأيمن من المنجم</VP></b>\n!حظا سعيدا",
		"!أتمنى لك يوم سعيد"
	},
	THOMPSON_QUESTIONS = {
		"أي وصفات؟",
		".فقط ألقي التحية"
	},
	COLE_DIALOGUES = {
		"هناك الكثير من \n<b><VP>الوحوش</VP></b>\n !في الخارج. رجاءا كن حذرا",
		".كل جيشنا يقاتل ضد الوحوش. نحن بحاجة إلى الكثير من المساعدة",
		".هييييي, انا لا استطيع ان ادعك تذهب هذا الطريق. ارجع في الحال"
	},
	MARC_DIALOGUES = {
		"انت سيء, لاتلمس طاولة العمل"
	},
	SARUMAN_DIALOGUES = {
		"!!!!هيييييييييييي!!!!هيييييي\nهل يوجد أحد ؟؟؟",
		"مهلا !! ساعدني في الخروج من هناك!\n!!!شكراً لله على أنقذك لي هنا",
		"انا \n<b><VP>سلمان</VP></b>\n ...على فكرة. لقد علقت هنا منذ ما يقرب\n15 سنة",
		"صديقي \n<b><VP>هادي</VP></b> \n.هو السبب في أنني ما زلت على قيد الحياة\nكنت سأموت من الجوع من دونه",
		"هل تريد أن تعرف كيف ولماذا أنا عالق هنا؟",
		"حسنًا ، قصة طويلة قصيرة ، عندما كنت لا أزال \nوقوي مثلك <b>يافع</b>\nسمعت عن هذه الكنوز تسمى \n<b><VP>روح الأجرام السماوية</VP></b>",
		".كنت أستاذًا أيضًا ، لذلك كنت مهتمًا جدًا بالبحث عن هذا الموضوع\nلقد جمعت الكثير من المعلومات عنهم",
		"هذه الأجرام السماوية مرتبطة بالروح. بمجرد أن يتم ربطهم مع الجميع \n<b><VP>الخمس الأجرام السماوية</VP></b>\n سيتم منحهم \n<b><VP> القوة الإلهية</VP></b>",
		"...لست متأكدًا من نوع القوة التي سأحصل عليها منهم أو ماذا سيفعلون بي \nلكنني متأكد من أن \n<b><VP>الشيوخ</VP></b>\n !يعرفون المزيد عن كيفية استخدامها",
		".لكن لم يعرف أحد مكانهم بالضبط ، لذلك جئت إلى هنا للعثور عليهم جميعًا بنفسي",
		"أعتقد أنني قمت بعمل جيد في العثور على واحد \n<VP><b>ضريح الجرم السماوي</b></VP>.\n.لكن ... اخترت الطريق الخطأ وظللت هنا إلى الأبد منذ ذلك الحين",
		".أنا سعيد لأنك ساعدتني! لا تتردد في التحدث معي لمعرفة أي شيء عن هذه الأجرام السماوية\nالمعرفة موجودة للمشاركة ، ولانك أنقذتني!",
		"نعم يا صاحبي! ماذا تريد ان تعرف مني؟",
		"كما قلت هناك \n<b><VP>خمس ارواح اجرام سماوية</VP></b>\n<b><VP>3</VP></b> يوجد \n يمكن العثور على منهم في \n<b><VP>الأضرحة</VP></b>\n .في هذه الغابة القاتمة\nأنا غير متأكد تمامًا من الباقي 2 على الرغم من ",
		".من المعلومات التي جمعتها ، سيتعين عليك مواجهة تحديات مختلفة للوصول إلى الأضرحة",
		"أعتقد أنك تعرف واحدًا بالفعل ما لم يكن لديك بعض القوة السحرية للانتقال الفوري هنا",
		"الضريح الثاني يحرسه الكثير من \n<b><VP>الوحوش</VP></b>\n في هذا الطريق \n!لذا جهز نفسك جيدًا قبل الاستكشاف هناك",
		"ووجدت هذا في الضريح الأخير \n<b><VP>دليل</VP></b>\n من الكتب القديمة",
		"<b><VP>\"الألغاز والأحاجي والتقاليد القديمة\nالنتيجة الرياضية ، ولكن ليس الجمع\nمورد مثمر للغاية\nيأتي مع تلك التقاليد الحقيقية\nخذ المرتبة المعروضة للجميع\nإلى العالم يجب عليك الاتصال\"</VP></b>",
		"هذا كل شئ! آمل أن تستفيد من هذه المعلومات بشكل جيد",
		"!شكرا لتفقدك لي يا صديقي",
		"!!!تبدو أوه وكأنك جمعت كل ارواح الاجرام السماوية \n نحن متعادلان الان ... اشكرني لاحقا\nولكن تأكد من العثور على مزيد من المعلومات حول هذه الأجرام السماوية من \n<b><VP>الشيخ</VP></b>"
	},
	SARUMAN_QUESTIONS = {
		"أين الأجرام السماوية؟",
		"!أتحقق وحسب"
	},
	MONK_DIALOGUES = {
		"...لقد كنت أمسك بهذه القوة الشريرة لفترة طويلة \nسعيد لسماع أنك أتيت لمساعدتنا",
		"لذا فأنت تخبرني أنك تمتلك كل  \n<b><VP> خمس ارواح الأجرام السماوية</VP></b>",
		"إنه عمل جيد بالفعل. الآن هذا سيجعل من السهل هزيمة قوة الشر إلى الأبد",
		"هذه الأجرام السماوية الروحية مرتبطة بالفعل بروح المرء\nيمكن للأفراد الشجعان فقط امتلاك كل الخمسة",
		"هذه الأجرام السماوية سوف تساعدك على الحصول على \n<b><VP>القوة الإلهية</VP></b>\n وهي الطريقة الوحيدة لتدمير الشر\nبقدر ما أعرف",
		"بمجرد تفعيل القدرة الإلهية ومواجهة الشر\nسيتعين عليك السير في طريق طويل داخل عقلك لتحقيق \n<b><VP>الوضع الإلهي</VP></b>",
		"ستساعدك الأجرام السماوية الروحية على إيجاد الطريق الصحيح لتحقيق ذلك\nما عليك سوى السفر بالطريقة التي تظهر بها لك في الوقت المناسب",
		"أنا متأكد من أنك لن تنجح في الحصول على أقوى طاقة إلهية\nلكن حتى لو اقتربت",
		"سيخلق طاقة إلهية كبيرة تستدعي بعد ذلك \n<b><VP>هيرا</VP></b>",
		"تقول الكتب القديمة أن الوحش قوي للغاية لكنني متأكد من أن\n<b><VP>مباركة هيرا</VP></b> \nسيضعها في حالة أضعف",
		"!!!وهو وقتنا إذًا أن نقضي على قوة الشر إلى الأبد",
		"!!!هيرا انها هنا\n!!!إنه يحدث"
	},
	NIELS_DIALOGUES = {
		"!الجميع يحتفظون بمواقعهم",
		"<b><VP>التنين</VP></b> \nعلى الجانب الآخر من النهر خطير جدًا\nسوف يستخدم\n<b><VP>الهجمات النارية</VP></b> \nوسوف \n<b><VP>يرمي الحجارة</VP></b> \nعليك",
		"...رجاءا كن حذرا",
		"ومع ذلك ، لا يمكننا مهاجمة التنين مباشرة ، حيث يبدو أن الجسر مكسور",
		"لقد دمره التنين مرة بناره عندما كان يحاول عبوره",
		"!!!لذلك علينا إصلاحه حتى نصل إليه أيضا"
	},
	PROPS = {
		attack = "هجوم",
		defense = "دفاع",
		durability = "قوة التحمل",
		chopping = "قطع",
		mining = "التعدين"
	}
}
