-- theme color pallete: https://www.colourpod.com/post/173929539115/a-medieval-recipe-for-murder-submitted-by

translations["ru"] = {
	OUT_OF_RESOURCES = "<font color='#ab5e42'>[</font> <font color='#c6b392'>•</font> <font color='#ab5e42'>]</font> <font color='#c6b392' face='Lucida Console'>Кончились ресурсы!</font>",
	NEW_RECIPE = "<font color='#506d3d' size='8'><b>[НОВЫЙ РЕЦЕПТ]</b></font> <font color='#ab5e42' face='Lucida Console'><b>${itemName}</b></font>\n<font color='#bd9d60' size='11' face='Lucida Console'>(${itemDesc})</font>",
	NEW_QUEST = "<font color='#506d3d' size='8'><b>[НОВЫЙ КВЕСТ]</b></font> <font color='#ab5e42' face='Lucida Console'><b>${questName}</b></font>",
	NEW_STAGE = "<font color='#506d3d' size='8'><b>[ОБНОВЛЕНИЕ]</b></font> <font color='#ab5e42' face='Lucida Console'><b>${questName}</b></font>\n<font color='#bd9d60' size='11' face='Lucida Console'>(${desc})</font>",
	STAGE_PROGRESS = "<font color='#506d3d' size='8'><b>[ОБНОВЛЕНИЕ]</b></font> <font color='#ab5e42' face='Lucida Console'><b>${questName}</b></font> <font color='#bd9d60' size='11' face='Lucida Console'>( ${progress} / ${needed} )</font>",
	QUEST_OVER = "<font color='#506d3d' size='8'><b>[ПРОЙДЕНО]</b></font> <font color='#ab5e42' face='Lucida Console'><b>${questName}</b></font>",
	SPIRIT_ORB = "<b><font color='#ab5e42' face='Lucida Console'>You received a <font color='#bd9d60' face='Lucida Console'>шар душ!</font></font></b>",
	PASSCODE = "Пожалуйста, введите пароль.",
	WRONG_GUESS = "<R>Неправильный пароль.</R>",
	INVENTORY_INFO = "<font face='Lucida Console'><p align='center'><font color='#${color}' size='9'>Weight: ${weight}</font>\n\n\n\n<font size='9'><N2><b>[X] Кинуть</b></N2></font></p></font>",
	FULL_INVENTORY = "<font color='#ab5e42'>[</font> <font color='#c6b392'>•</font> <font color='#ab5e42'>]</font> <font color='#c6b392' face='Lucida Console'>Ваш инвентарь полон!</font>",
	FINAL_BOSS_ENTER_FAIL = "<font color='#ab5e42'>[</font> <font color='#c6b392'>•</font> <font color='#ab5e42'>]</font> <font color='#c6b392' face='Lucida Console'>Тебе нужен драконий шар душ чтобы зайти в портал!</font>",
	CRAFT = "Смастерить!",
	CANT_CRAFT = "Нельзя смастерить",
	RECIPE_DESC = "\n\n<font face='Lucida console' size='12' color='#999999'><i>“ ${desc} ”</i></font>",
	FINAL_BATTLE_PING = "<font color='#ab5e42'>[</font> <font color='#c6b392'>•</font> <font color='#ab5e42'>]</font> <font color='#c6b392' face='Lucida Console'>Финальный бой!</font>",
	ACTIVATE_POWER = "<font color='#ab5e42'>[</font> <font color='#c6b392'>•</font> <font color='#ab5e42'>]</font> <font color='#c6b392' face='Lucida Console'>Жми <font color='#ab5e42'><b>U</b></font> чтобы запустить <font color='#ab5e42'><b>божественную силу!</b></font></font>",
	ANNOUNCER_DIALOGUES = {
		"ВНИМАНИЕ ВСЕ! ВНИМАНИЕ!!!",
		"Это послание от его высочества, славного короля этих земель...",
		"Наши земли под атакой беспощадных монстров которые были когда-то свергнуты.",
		"Дальше произошло ужасное. <b><VP>Нашу принцессу похитили.</VP></b>",
		"Эти беспощадные монстры смогли так же унести всю нашу казну.",
		"Король ищет ХРАБРЫХ СОЛДАТОВ которые отправятся в миссию и спасут нашу принцессу\nи богатства",
		"Король ждёт присутствия всех храбрых сердцем...\n"
	},
	NOSFERATU_DIALOGUES = {
		"Так-так, ты кажется новечок... В любом случае, ты явно полезный(ая)",
		"Так ты говоришь, что пришёл(ла) из другого измирения и не понимаешь, где ты и что делать\n<i>*Хммм, может он(а) действительно может мне пригодиться</i>",
		"Ну, юноша (юная леди), тебе нужна работа чтобы выжить. Не волнуйся, я дам тебе работу. Да да.",
		"Но... сначала, нам нужно проверить в хорошей ли ты форме.\nСобери <VP><b>15 дерева</b></VP> для меня в лесу.\nВот тебе <VP><b>10 камней</b></VP> заранее. Удачи!",
		"Впечатляет. Но <i>в наши дни</i> мы делали это быстрее...\nНе имеет значения. Как я обещал, <VP><b>работа</b></VP> твоя.",
		"Теперь у тебя есть доступ к <b><VP>шахте</VP></b>\nИди к <b><VP>двери</VP></b> справа от меня и жми <b><VP>↓</VP></b> чтобы открыть её!",
		"В первую очередь, мне нужно чтобы ты достал(а) <b><VP> 15 железа</VP></b>. Опять же, удачи!",
		"Вау! Кажется я тебя недооценил, потрясающая работа!",
		"Я слышал что <b><VP>замок</VP></b> нуждается в нескольких юных солдат чтобы спасти казну и принцессу...",
		"Ты бы подошёл(ла)!",
		"Я дам тебе <b><VP>письмо рекомендации от Носферату</VP></b>, вручи его <b><VP>Лейтенанту</VP></b> и надеюсь тебя примут в армию.\n<i>И тут ещё хорошие деньги</i>",
		"Ах да, не забудь свою награду в <b><VP>30 камня</VP></b> за твой труд!",
		"Могу ли я чем-то помочь?",
		"Это все знают... Тебе надо <b><VP>срубить дерево топором</VP></b>",
		"Так тебе нужен <b><VP>топор</VP></b>? Один должен валяться в <b><VP>лесу</VP></b>. <b><VP>↓</VP></b> чтобы изучить рецепт и сделать его в <b><VP>мастерской</VP></b>.\nОдна мастерская находится прямо над этой шахтой.",
		"Я продаю <b><VP>10 камня</VP></b> за <b><VP>35 веток</VP></b>",
		"Тогда до встречи",
		"Твой инвентарь кажется полный. Сделай немного места и вернись за наградой.",
		"Хорошо иметь с тобой дело!",
		"Кажется тебе не хватает ресурсов для такого обмена, дитя."
	},
	NOSFERATU_QUESTIONS = {
		"Как мне достать дерево?",
		"Топор?",
		"Обмен",
		"Не важно.",
		"It's something else."
	},
	EDRIC_DIALOGUES = {
		"Наша принцесса... и богатства в руках чудищ. Нужно торопиться",
		"Погоди. Значит, <b><VP>Носферату</VP></b> послал тебя чтобы ты смог(ла) помочь солдатам в миссии???",
		"Прелестно. Но быть в армии труднее чем ты думаешь.\nТебе придётся пройти <b><VP>интенсивную подготовку</VP></b>, так как ты не в форме.\nИди к <b><VP>зоне тренировок слева от меня</VP></b> чтобы приступить.",
		"Для начала, убедись что ты полностью подготовлен(а). Там есть несколько <b><VP>рецептов</VP></b>, разброссаные по <b><VP>полкам с оружием</VP></b> и в <b><VP>мрачных лесах вниз по холму</VP></b>\nНадеюсь, ты хорошо их используешь!",
		"Вернись ко мне когда будешь готов(а)!",
		"Ты готов(а) принять вызов?",
		"Прекрасно! Начни тренировку в зоне тренировок. Тебе надо <b><VP>победить 25 монстров</VP></b> чтобы пройти испытание.",
		"Можешь брать сколько времени хочешь\nУдачи тебе!!!",
		"Ты доказал(а) что стоишь чего-то! Быстро!!! Присоединяйся к солдатам и иди сражаться с монстрами!"
	},
	EDRIC_QUESTIONS = {
		"Мне нужно больше времени...",
		"Я готов(а)!"
	},
	GARRY_DIALOGUES = {
		"Это худшее где я был. <b><VP>Носферату</VP></b> даже не платит достаточно. <i>*вздох...*</i>"
	},
	THOMPSON_DIALOGUES = {
		"Привет! Тебе что-то от меня нужно?",
		"Если ты ищешь <b><VP>лопату</VP></b>, одна должна быть в <b><VP>правом конце от меня</VP></b>.\nУдачи!",
		"Хорошого дня!"
	},
	THOMPSON_QUESTIONS = {
		"Какие-то рецепты?",
		"Просто поздоровался(ась)."
	},
	COLE_DIALOGUES = {
		"Тут куча <b><VP>монстров</VP></b> вокруг. Будь осторожен(на)!",
		"Вся наша армия дерётся с монстрами. Нам нужно много помощи.",
		"ААААА! Я не могу дать такому слабаку пройти туда. ВЕРНИСЬ СЮДА!"
	},
	MARC_DIALOGUES = {
		"ПЛОХОЙ(АЯ)! Не трогай мою рабочую скамью!"
	},
	SARUMAN_DIALOGUES = {
		"АУУУ!!!! АААУУУУУУ!!!!\nЗДЕСЬ КТО-НИБУДЬ ЕСТЬ???",
		"ЭЙЙ!! ПОМОГИТЕ МНЕ!\nХОРОШО ЧТО КТО-ТО ЗДЕСЬ ПРИШЁЛ СПАСАТЬ!!!",
		"Я <b><VP>Саруман</VP></b>, кстати. Я застрял здесь уже...\n15 лет?",
		"Мой дружок <b><VP>Хути</VP></b> причина по которой я ещё дышу.\nБез него, я бы умер от голода",
		"Так ты хочешь знать как я попал тут?",
		"Ну, коротко, когда я был ещё <b>молодым</b> и сильным как ты,\nя слышал об этих сокровищах под названием <b><VP>шары душ</VP></b>",
		"Я был профессором и интересовался этой темой.\nЯ собрал кучу знаний о них",
		"Эти шары привязаны к душе какого-то человека. Когда человек связан со всеми <b><VP>5 шарами</VP></b>, он(а) обретает <b><VP>божественную силу</VP></b>",
		"Я не уверен, какую силу смог бы получить от них или что бы они мне дали...\nНо я уверен, <b><VP>монахи</VP></b> знают больше о том, как их использовать!",
		"Никто не знал где они находятся, так что я пришёл найти их сам.",
		"Я справился в поисках одного из <VP><b>шаров алтаря</b></VP>.\nНо... я выбрал неправильный путь и остался в заточении здесь, навсегда.",
		"Я рад что ты меня нашёл(ла)! Можешь спрашивать что хочешь про шары.\nЗнаниями нужно делиться, а ты ещё спас(ла) меня!",
		"Да, дружок! Что тебе нужно от меня?",
		"Как я говорил, есть <b><VP>5 шаров душ</VP></b>\n<b><VP>3</VP></b> из них можно найти в <b><VP>алтарях</VP></b> в этом мрачном лесу.\nЯ не уверен насчёт других 2...",
		"По моим расчётам, ты столкнёшься с многочисленными преградами по пути в алтари.",
		"Я думаю ты знаешь один уже, только если ты не очутился(лась) сюда магическим образом",
		"Второй алтарь защищён <b><VP>многими монстрами</VP></b> по пути.\nПодготовься перед тем как идти туда!",
		"А для последнего алтаря, я нашёл эту <b><VP>зацепку</VP></b> из древних книг",
		"<b><VP>\"Головоломки, и загадки, и старое умение\nМатематический скор, но не сложение\nРесурс что так жизненно нёс\nМирится с чьим-то знанием \nБери всем показанный ранк\nИ к миру ты должен призвать\"</VP></b>",
		"Это всё! Надеюсь ты используешь эти знания с умом",
		"Спасибо что навестил(а) меня!",
		"ПОХОЖЕ, ТЫ ДОСТАЛ(А) ВСЕ ШАРЫ ДУШ!!!\nТеперь мы в расчёте... потом поблагодаришь!\nУзнай больше информации об этих шарах у <b><VP>монаха</VP></b>"
	},
	SARUMAN_QUESTIONS = {
		"Где шары?",
		"Просто проверял(а)!"
	},
	MONK_DIALOGUES = {
		"Я держал эту злую силу в узде долгое время...\nРад что ты примкнул(а) нам на помощь",
		"Так у тебя есть все <b><VP>5 шаров душ</VP></b>",
		"Хорошо сделано. Это поможет тебе свергнуть злую силу навеки",
		"Эти шары действительно привязаны к душе\nТолько храбрые люди могут обуздать все 5",
		"Эти шары помогут тебе получить <b><VP>божественную силу</VP></b> - единственный способ одолеть зло\n, насколько мне известно",
		"Когда ты активируешь божественную силу и одолеешь зло...\nтебе придётся пройти долгий путь в разуме чтобы достичь <b><VP>божественного статуса</VP></b>",
		"Шары душ помогут тебе найти путь.\nТебе лишь придётся пройти правильный путь когда наступит время!",
		"Я почти уверен что тебе не удастся достичь высшей силы.\nНо если ты хотя бы приблизишься...",
		"Оно создаст волну энергии, которая призовёт <b><VP>богиню</VP></b>",
		"Древние книги говорят что бестия слишком сильна, но я уверен что \n<b><VP>благословение богини</VP></b> ослабит её",
		"И тогда, мы сможем свергнуть зло навсегда!!!",
		"Богиня... она пришла\nЭТО ПРОИСХОДИТ!!!"
	},
	NIELS_DIALOGUES = {
		"Вы все, будьте на чеку!",
		"<b><VP>Дракон</VP></b> на другом берегу слишком опасный.\nОн использует свой <b><VP>fогненный удар</VP></b> и <b><VP>кинет камни</VP></b> в тебя",
		"Будь осторожен...",
		"Мы не можем атаковать дракона прямо, так как мост сломан",
		"Дракон разрушил его своим пламенем, когда пытался пересечь его.",
		"Так что... нам придётся его починить чтобы достать дракона. Торопись!!!"
	},
	PROPS = {
		attack = "Атака",
		defense = "Оборона",
		durability = "Длительность",
		chopping = "Рубление",
		mining = "Раскопки"
	}
}